Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_trial/types_of_sentences.html.txt.tmx
Source language: en
Languages: ga

source: The Criminal Justice Act 2006 introduced a system for convicted drug traffickers similar to those mentioned for sex offenders
ga: Thug an tAcht um Cheartas Coiriúil 2006 córas isteach do gháinneálaithe drugaí ciontaithe cosúil lena bhfuil i gceist do chiontóirí gnéis

source: It allows the court to make an order which obliges you to notify the Gardaí of your name and address
ga: Ceadaíonn sé don chúirt ordú a dhéanamh a chuireann iallach a chur ort d'ainm agus do sheoladh a chur in iúl do na Gardaí

source: The order is only made by the court if it considers that it is in the interest of the common good and that it is appropriate, given the circumstances of your case
ga: Ní dhéantar an t-ordú ach amháin má bhíonn an chúirt den tuairim go mbeadh a leithéid d'ordú cuí ar mhaithe le leas an phobail, agus cúinsí do cháis a gcur san áireamh

source: More information is available in the document on the Drug Offenders Register
ga: Tá tuilleadh eolais le fáil sa cháipéis ar Chlár na gCiontóirí Drugaí

source: Minimum sentences for firearm offences
ga: Íos-phianbhreitheanna do chionta airm tine

source: Mandatory minimum sentences apply to certain firearm offences
ga: Is iad seo a leanas na cionta lena mbaineann na pianbhreitheanna seo

source: The following are the offences to which this sentencing applies
ga: Tá discréid ag an mbreitheamh i gcás an chéad chiona
